// =====================================================================================
//
//       Filename:  pointer.c
//
//    Description:  测试指针的一些操作
//
//        Version:  1.0
//        Created:  01/17/2025 16:36:28
//       Revision:  none
//       Compiler:  gcc
//
//         Author:  binbin.chen (), binbin.chen0403@gmail.com
//   Organization:
//
// =====================================================================================

#include <stdio.h>
#include <stdlib.h>

void f(void) {
    int a[4];
    int *b = malloc(16);
    int *c;
    int i;

    printf("1: a = %p, b = %p, c = %p\n", a, b, c);
    // 1: a = 0x7ff7b88ad380, b = 0x600003a70030, c = 0x7ff7b88ad340
    // 由于后面修改了b的指向，所以如果需要释放内存，则需要提前，不用这块内存了就释放，否则会造成内存泄漏
    // 当然，这种测试程序，程序退出了，操作系统自然就把资源回收了，但是如果是一个长期运行的程序，就需要注意了
    free(b);

    c = a;
    for (i = 0; i < 4; i++)
        a[i] = 100 + i;
    c[0] = 200;
    printf("2: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n", a[0], a[1], a[2], a[3]);
    // 2: a[0] = 200, a[1] = 101, a[2] = 102, a[3] = 103

    c[1] = 300;
    *(c + 2) = 301;
    // 在 C 语言中，数组下标运算符 [] 是一种语法糖，它实际上是指针运算的一种形式。
    // 表达式 a[i] 等价于 *(a + i)。因此，3[c] 也是合法的，它等价于 *(3 + c)，也就是 c[3]。
    3 [c] = 302;
    printf("3: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n", a[0], a[1], a[2], a[3]);
    // 3: a[0] = 200, a[1] = 300, a[2] = 301, a[3] = 302

    c = c + 1;
    *c = 400;
    printf("4: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n", a[0], a[1], a[2], a[3]);
    // 4: a[0] = 200, a[1] = 400, a[2] = 301, a[3] = 302

    c = (int *)((char *)c + 1);
    *c = 500;
    printf("5: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n", a[0], a[1], a[2], a[3]);
    // 指针c被强转成char*，从4byte变成1byte，因此指向变成了a[0] + 1byte，修改这里后面4byte为500
    // 首先测试了一下，本台mac是小端序，低位存储在低地址
    // a[1]:400(0x190) -> 0x90 0x01 0x00 0x00
    // a[2]:301(0x12d) -> 0x2d 0x01 0x00 0x00
    // 连在一起就是 0x90 0x01 0x00 0x00 0x2d 0x01 0x00 0x00
    //                  |
    //              c指针指向这里
    // 500: 0x1f4 -> 0xf4 0x01 0x00 0x00
    // 接着我们修改这里的值，就是把0x90 0x01 0x00 0x00改成0xf4 0x01 0x00 0x00
    // 得到结果是 0x90 0xf4 0x01 0x00 0x00 0x01 0x00 0x00
    // 拆分到a[1]和a[2]就是 0x90 0xf4 0x01 0x00 和 0x00 0x01 0x00 0x00
    // 转换成10进制就是128144和256
    // 5: a[0] = 200, a[1] = 128144, a[2] = 256, a[3] = 302

    b = (int *)a + 1;
    c = (int *)((char *)a + 1);
    printf("6: a = %p, b = %p, c = %p\n", a, b, c);
    // 这里输出地址，验证刚刚的推论
    // 输出的地址中，b - a = 4, c - a = 1
    // 6: a = 0x7ff7b88ad380, b = 0x7ff7b88ad384, c = 0x7ff7b88ad381
}

// 因为分配在栈上的内存，函数结束后资源会被回收，因此需要使用malloc，或者传入返回值
char* makeABC() {
    char *y = malloc(4);  // 分配 4 字节的内存（包括终止符）
    if (y == NULL) {
        fprintf(stderr, "Memory allocation failed\n");
        exit(1);
    }
    y[0] = 'a';
    y[1] = 'b';
    y[2] = 'c';
    y[3] = '\0';  // 添加字符串终止符
    return y;
}

int main(int ac, char **av) {
    f();
    char *x = makeABC();
    printf("ABC string: %s\n", x);
    return 0;
}
